[{"attachments":[],"author":"Zakharov Roman, AN-34","content":"Наверное, самое сложное в обучении программированию - это сохранять мотивацию и сосредоточенность на протяжении 8 месяцев и более.\nhttps://www.youtube.com/watch?v\u003dlFEbdPdUt40\u0026ab_channel\u003dSergeyNemchinskiy\nКак не выгореть во время учебы.","id":13,"likedByMe":true,"likes":1,"published":"15 November, 15:30","shares":1,"views":0},{"attachments":[],"author":"Zakharov Roman, AN-34","content":"Книга по Kotlin «Kotlin in Action»\nПо Java Хорстманна «Java. Библиотека профессионала. Том 1. Основы».\nStartAndroid.ru. Некоторые уроки там устарели, но для базы этого хватит.\nВидеокурс по андроид от Mail.ru https://www.youtube.com/playlist?list\u003dPLrCZzMib1e9ptI7bPXFG8X5xEiCBt5qYE\n\nКак пишутся тесты, поможет https://bit.ly/32gyQz5\nЧто такое архитектура, есть там же https://bit.ly/32dNvLi\nПаттерны. Советую бесплатный видео-курс от Сергея Немчинского https://bit.ly/33Dv5nC","id":11,"likedByMe":true,"likes":1,"published":"15 November, 9:27","shares":0,"views":0},{"attachments":[],"author":"Zakharov Roman, AN-34","content":"Navigation occurs between your app\u0027s destinations—that is, anywhere in your app to which users can navigate. These destinations are connected via actions.\n\nA navigation graph is a resource file that contains all of your destinations and actions. The graph represents all of your app\u0027s navigation paths.\n\n","id":10,"likedByMe":true,"likes":1,"published":"14 November, 20:44","shares":0,"views":0},{"attachments":[{"attachment":"https://www.youtube.com/watch?v\u003dNGoITotysLc","id":0,"preview":2131165352}],"author":"Проект Гитарин","content":"Гитарин - проект Виталия Каменюченко и Евгения Соколова, который появился в 2011 году на YouTube как обучающий канал для начинающих гитаристов. Со временем Гитарин трансформировался в творческую единицу с авторским материалом.","id":7,"likedByMe":true,"likes":74,"published":"04 ноября в 14:44","shares":34,"views":78},{"attachments":[],"author":"Нетология. Университет интернет-профессий будущего","content":"Системный администратор — специалист, который отвечает за стабильное и безотказное функционирование IT-инфраструктуры, занимается настройкой сетей, мониторингом, следит за безопасностью данных, а также проводит инвентаризацию и обновление программного обеспечения компании. Курс даст углубленные знания и подготовит вас к работе: обучитесь системному администрированию на практике, получите возможность найти работу уже во время обучения, будете знать больше, чем нужно работодателям, изучите современные инструменты для работы с инфраструктурой, получите углубленные знания основ администрирования Linux, откроете новые возможности с помощью английского языка.","id":6,"likedByMe":true,"likes":10,"published":"19 октября в 13:27","shares":5,"views":7},{"attachments":[],"author":"Нетология. Университет интернет-профессий будущего","content":"Android — самая популярная мобильная платформа. Android-разработчики востребованы всё больше: согласно Statcounter, Android занимает больше 70% рынка мобильных устройств, и число пользователей во всём мире растёт каждый год. За время курса вы создадите полноценное приложение под Android — социальную сеть формата LinkedIn с размещением постов, информацией о профессиональных связях, местах работы и чекинах. Такой проект позволит вам применить разные возможности Kotlin, включая работу с серверной частью и локальной базой данных, с камерой смартфона и его GPS-модулем.","id":5,"likedByMe":false,"likes":21,"published":"03 сентября в 10:16","shares":7,"views":23},{"attachments":[],"author":"Нетология. Университет интернет-профессий будущего","content":"Тестировщик следит за качеством программного продукта — проверяет, насколько реальное поведение программы соответствует ожиданиям. Спрос на тестировщиков очень высок — каждая команда разработки стремится выпускать качественный продукт без багов. Эта профессия может стать первой ступенью вашей карьеры в IT-проекте или основным делом.","id":4,"likedByMe":false,"likes":50,"published":"22 августа в 17:35","shares":12,"views":41},{"attachments":[],"author":"Нетология. Университет интернет-профессий будущего","content":"Java-разработчик. На java работают сайты, CRM-системы, Android-приложения, игры, программы для умных домов и ракет, так как это кроссплатформенный язык программирования. Программисты занимаются созданием таких продуктов, как Tesla, Minecraft, IntelliJ, Deutsche Bank, Barclays и миллионов других. Java-разработчики проектируют и реализуют логику работы приложения.","id":3,"likedByMe":false,"likes":59,"published":"17 июля в 12:57","shares":19,"views":44},{"attachments":[],"author":"Нетология. Университет интернет-профессий будущего","content":"iOS-разработчик. Всё больше компаний создают приложения для iOS. Средняя зарплата IOS‑разработчика выше, чем у других мобильных разработчиков. Конкуренция в этом направлении ниже, так как меньше приложений и разработчиков в этой сфере. Вам потребуется меньше года, чтобы получить  навыки для старта карьеры. За 1,5 года junior-специалист может стать middle.","id":2,"likedByMe":false,"likes":77,"published":"29 июня в 19:22","shares":34,"views":64},{"attachments":[],"author":"Нетология. Университет интернет-профессий будущего","content":"Привет, это новая Нетология! Когда-то Нетология начиналась с интенсивов по онлайн-маркетингу. Затем появились курсы по дизайну, разработке, аналитике и управлению. Мы растём сами и помогаем расти студентам: от новичков до уверенных профессионалов. Но самое важное остаётся с нами: мы верим, что в каждом уже есть сила, которая заставляет хотеть больше, целиться выше, бежать быстрее. Наша миссия — помочь встать на путь роста и начать цепочку перемен → http://netolo.gy/fyb","id":1,"likedByMe":true,"likes":101,"published":"21 мая в 18:36","shares":52,"views":118}]